export function dateFormat(u_date, u_fmt) {
    let date = new Date(u_date);
    let fmt = u_fmt;
    if (date.toString() === "Invalid Date") {
        date = new Date();
        fmt = u_date;
    }
    const o = {
        "M+": date.getMonth() + 1, //月份
        "d+": date.getDate(), //日
        "h+": date.getHours(), //小时
        "m+": date.getMinutes(), //分
        "s+": date.getSeconds(), //秒
        "q+": Math.floor((date.getMonth() + 3) / 3), //季度
        "S": date.getMilliseconds() //毫秒
    };
    if (/(y+)/.test(fmt)) fmt = fmt.replace(RegExp.$1, (date.getFullYear() + "").substr(4 - RegExp.$1.length));
    for (var k in o)
        if (new RegExp("(" + k + ")").test(fmt)) fmt = fmt.replace(RegExp.$1, (RegExp.$1.length === 1) ? (o[k]) : (("00" + o[k]).substr(("" + o[k]).length)));
    return fmt;
}

export function whichType(data) {
    return Object.prototype.toString.call(data).slice(1, -1).split(' ').pop();
}

export function isEmpty(data) {
    const type = Object.prototype.toString.call(data).slice(1, -1).split(' ').pop();
    switch (type) {
        case 'String':
            if (!data.length) return true;
            break;
        case 'Object':
            if (!Object.keys(data).length) return true;
            break;
        case 'Array':
            if (!data.length) return true;
            break;
        case 'Function':
            if (data.toString().match(/{[\S\s]*}/ig).shift().replace(/\s/ig, '') === '{}') return true;
            break;
        case 'Number':
            if (!data) return true;
            break;
        case 'Boolean':
            if (!data) return true;
            break;
        case 'Null':
            if (!data) return true;
            break;
        case 'Undefined':
            if (!data) return true;
            break;
        case 'Date':
            if (!new Date(data).getTime()) return true;
            break;
        case 'Set':
            if (!data.size) return true;
            break;
        case 'Map':
            if (!data.size) return true;
            break;
        default:
            return false;
    }
    return false;
}

export function deepClone(data) {
    var type = Object.prototype.toString.call(data).slice(8,-1);
    var obj = null;
    if (type === 'Array') {
        obj = [];
        data.forEach((item) => obj.push(deepClone(item)));
    } else if (type === 'Object') {
        obj = {};
        Object.keys(data).forEach((item) => obj[item] = deepClone(data[item]));
    } else {
        return data;
    }
    return obj;
}

export const provinceName = {
    ["无"]: "未知",
    ["冀"]: "河北",
    ["辽"]: "辽宁",
    ["皖"]: "安徽",
    ["苏"]: "江苏",
    ["鄂"]: "湖北",
    ["晋"]: "山西",
    ["吉"]: "吉林",
    ["粤"]: "广东",
    ["宁"]: "宁夏",
    ["京"]: "北京",
    ["豫"]: "河南",
    ["黑"]: "黑龙江",
    ["鲁"]: "山东",
    ["浙"]: "浙江",
    ["桂"]: "广西",
    ["蒙"]: "内蒙古",
    ["闽"]: "福建",
    ["川"]: "四川",
    ["渝"]: "重庆",
    ["津"]: "天津",
    ["云"]: "云南",
    ["湘"]: "湖南",
    ["新"]: "新疆",
    ["赣"]: "江西",
    ["甘"]: "甘肃",
    ["陕"]: "陕西",
    ["贵"]: "贵州",
    ["青"]: "青海",
    ["藏"]: "西藏",
    ["琼"]: "海南",
    ["沪"]: "上海"
};

export const carLicenceCity = {
    ["无车"]: "未知", 
    ["冀A"]: "石家庄", 
    ["冀B"]: "唐山", 
    ["冀C"]: "秦皇岛", 
    ["冀D"]: "邯郸", 
    ["冀E"]: "邢台", 
    ["冀F"]: "保定", 
    ["冀G"]: "张家口", 
    ["冀H"]: "承德", 
    ["冀J"]: "沧州", 
    ["冀R"]: "廊坊", 
    ["冀S"]: "沧州", 
    ["冀T"]: "衡水", 
    ["辽A"]: "沈阳", 
    ["辽B"]: "大连", 
    ["辽C"]: "鞍山", 
    ["辽D"]: "抚顺", 
    ["辽E"]: "本溪", 
    ["辽F"]: "丹东", 
    ["辽G"]: "锦州", 
    ["辽H"]: "营口", 
    ["辽J"]: "阜新", 
    ["辽K"]: "辽阳", 
    ["辽L"]: "盘锦", 
    ["辽M"]: "铁岭", 
    ["辽N"]: "朝阳", 
    ["辽P"]: "葫芦岛", 
    ["皖A"]: "合肥", 
    ["皖B"]: "芜湖", 
    ["皖C"]: "蚌埠", 
    ["皖D"]: "淮南", 
    ["皖E"]: "马鞍山", 
    ["皖F"]: "淮北", 
    ["皖G"]: "铜陵", 
    ["皖H"]: "安庆", 
    ["皖J"]: "黄山", 
    ["皖K"]: "阜阳", 
    ["皖L"]: "宿州", 
    ["皖M"]: "滁州", 
    ["皖N"]: "六安", 
    ["皖P"]: "宣城", 
    ["皖Q"]: "巢湖", 
    ["皖R"]: "池州", 
    ["皖S"]: "亳州", 
    ["苏A"]: "南京", 
    ["苏B"]: "无锡", 
    ["苏C"]: "徐州", 
    ["苏D"]: "常州", 
    ["苏E"]: "苏州", 
    ["苏F"]: "南通", 
    ["苏G"]: "连云港", 
    ["苏H"]: "淮安", 
    ["苏J"]: "盐城", 
    ["苏K"]: "扬州", 
    ["苏L"]: "镇江", 
    ["苏M"]: "泰州", 
    ["苏N"]: "宿迁", 
    ["鄂A"]: "武汉", 
    ["鄂B"]: "黄石", 
    ["鄂C"]: "十堰", 
    ["鄂D"]: "荆州", 
    ["鄂E"]: "宜昌", 
    ["鄂F"]: "襄樊", 
    ["鄂G"]: "鄂州", 
    ["鄂H"]: "荆门 ", 
    ["鄂J"]: "黄冈", 
    ["鄂K"]: "孝感", 
    ["鄂L"]: "咸宁", 
    ["鄂M"]: "仙桃", 
    ["鄂N"]: "潜江", 
    ["鄂P"]: "神农架林区", 
    ["鄂Q"]: "恩施土家族苗族自治州", 
    ["鄂R"]: "天门", 
    ["鄂S"]: "随州", 
    ["晋A"]: "太原", 
    ["晋B"]: "大同", 
    ["晋C"]: "阳泉", 
    ["晋D"]: "长治", 
    ["晋E"]: "晋城", 
    ["晋F"]: "朔州", 
    ["晋H"]: "忻州", 
    ["晋J"]: "吕梁地区", 
    ["晋K"]: "晋中", 
    ["晋L"]: "临汾", 
    ["晋M"]: "运城", 
    ["吉A"]: "长春", 
    ["吉B"]: "吉林", 
    ["吉C"]: "四平", 
    ["吉D"]: "辽源", 
    ["吉E"]: "通化", 
    ["吉F"]: "白山", 
    ["吉G"]: "白城", 
    ["吉H"]: "延边朝鲜族自治州", 
    ["吉J"]: "松原", 
    ["吉K"]: "长白山", 
    ["粤A"]: "广州", 
    ["粤B"]: "深圳", 
    ["粤C"]: "珠海", 
    ["粤D"]: "汕头", 
    ["粤E"]: "佛山", 
    ["粤F"]: "韶关", 
    ["粤G"]: "湛江", 
    ["粤H"]: "肇庆", 
    ["粤J"]: "江门", 
    ["粤K"]: "茂名", 
    ["粤L"]: "惠州", 
    ["粤M"]: "梅州", 
    ["粤N"]: "汕尾", 
    ["粤P"]: "河源", 
    ["粤Q"]: "阳江", 
    ["粤R"]: "清远", 
    ["粤S"]: "东莞", 
    ["粤T"]: "中山", 
    ["粤U"]: "潮州", 
    ["粤V"]: "揭阳", 
    ["粤W"]: "云浮", 
    ["粤X"]: "顺德区", 
    ["粤Y"]: "南海区", 
    ["粤Z"]: "港澳进入内地车辆", 
    ["宁A"]: "银川", 
    ["宁B"]: "石嘴山", 
    ["宁C"]: "银南", 
    ["宁D"]: "固原", 
    ["宁E"]: "中卫", 
    ["京A"]: "北京", 
    ["京B"]: "北京", 
    ["京C"]: "北京", 
    ["京D"]: "北京", 
    ["京E"]: "北京", 
    ["京F"]: "北京", 
    ["京G"]: "北京", 
    ["京H"]: "北京", 
    ["京J"]: "北京", 
    ["京K"]: "北京", 
    ["京L"]: "北京", 
    ["京M"]: "北京", 
    ["京Y"]: "北京", 
    ["豫A"]: "郑州", 
    ["豫B"]: "开封", 
    ["豫C"]: "洛阳", 
    ["豫D"]: "平顶山", 
    ["豫E"]: "安阳", 
    ["豫F"]: "鹤壁", 
    ["豫G"]: "新乡", 
    ["豫H"]: "焦作", 
    ["豫J"]: "濮阳", 
    ["豫K"]: "许昌", 
    ["豫L"]: "漯河", 
    ["豫M"]: "三门峡", 
    ["豫N"]: "商丘", 
    ["豫P"]: "周口", 
    ["豫Q"]: "驻马店", 
    ["豫R"]: "南阳", 
    ["豫S"]: "信阳", 
    ["豫U"]: "济源", 
    ["黑A"]: "哈尔滨", 
    ["黑B"]: "齐齐哈尔", 
    ["黑C"]: "牡丹江", 
    ["黑D"]: "佳木斯", 
    ["黑E"]: "大庆", 
    ["黑F"]: "伊春", 
    ["黑G"]: "鸡西", 
    ["黑H"]: "鹤岗", 
    ["黑J"]: "双鸭山", 
    ["黑K"]: "七台河", 
    ["黑L"]: "松花江地区", 
    ["黑M"]: "绥化", 
    ["黑N"]: "黑河", 
    ["黑P"]: "大兴安岭地区", 
    ["黑R"]: "农垦系统", 
    ["鲁A"]: "济南", 
    ["鲁B"]: "青岛", 
    ["鲁C"]: "淄博", 
    ["鲁D"]: "枣庄", 
    ["鲁E"]: "东营", 
    ["鲁F"]: "烟台", 
    ["鲁G"]: "潍坊", 
    ["鲁H"]: "济宁", 
    ["鲁J"]: "泰安", 
    ["鲁K"]: "威海", 
    ["鲁L"]: "日照", 
    ["鲁M"]: "滨州", 
    ["鲁N"]: "德州", 
    ["鲁P"]: "聊城", 
    ["鲁Q"]: "临沂", 
    ["鲁R"]: "菏泽", 
    ["鲁S"]: "莱芜", 
    ["鲁U"]: "青岛增补", 
    ["鲁V"]: "潍坊增补", 
    ["鲁Y"]: "烟台", 
    ["浙A"]: "杭州", 
    ["浙B"]: "宁波", 
    ["浙C"]: "温州", 
    ["浙D"]: "绍兴", 
    ["浙E"]: "湖州", 
    ["浙F"]: "嘉兴", 
    ["浙G"]: "金华", 
    ["浙H"]: "衢州", 
    ["浙J"]: "台州", 
    ["浙K"]: "丽水", 
    ["浙L"]: "舟山", 
    ["桂A"]: "南宁", 
    ["桂B"]: "柳州", 
    ["桂C"]: "桂林", 
    ["桂D"]: "梧州", 
    ["桂E"]: "北海", 
    ["桂F"]: "崇左", 
    ["桂G"]: "来宾", 
    ["桂H"]: "桂林地区", 
    ["桂J"]: "贺州", 
    ["桂K"]: "玉林", 
    ["桂L"]: "百色", 
    ["桂M"]: "河池", 
    ["桂N"]: "钦州", 
    ["桂P"]: "防城港", 
    ["桂R"]: "贵港", 
    ["蒙A"]: "呼和浩特", 
    ["蒙B"]: "包头", 
    ["蒙C"]: "乌海", 
    ["蒙D"]: "赤峰", 
    ["蒙E"]: "呼伦贝尔 ", 
    ["蒙F"]: "兴安盟", 
    ["蒙G"]: "通辽", 
    ["蒙H"]: "锡林郭勒盟", 
    ["蒙J"]: "乌兰察布盟", 
    ["蒙K"]: "鄂尔多斯 ", 
    ["蒙L"]: "巴彦淖尔盟", 
    ["蒙M"]: "阿拉善盟", 
    ["闽A"]: "福州", 
    ["闽B"]: "莆田", 
    ["闽C"]: "泉州", 
    ["闽D"]: "厦门", 
    ["闽E"]: "漳州", 
    ["闽F"]: "龙岩", 
    ["闽G"]: "三明", 
    ["闽H"]: "南平", 
    ["闽J"]: "宁德", 
    ["闽K"]: "直系统", 
    ["川A"]: "成都", 
    ["川B"]: "绵阳", 
    ["川C"]: "自贡", 
    ["川D"]: "攀枝花", 
    ["川E"]: "泸州", 
    ["川F"]: "德阳", 
    ["川H"]: "广元", 
    ["川J"]: "遂宁", 
    ["川K"]: "内江", 
    ["川L"]: "乐山", 
    ["川M"]: "资阳", 
    ["川Q"]: "宜宾", 
    ["川R"]: "南充", 
    ["川S"]: "达州", 
    ["川T"]: "雅安", 
    ["川U"]: "阿坝藏族羌族自治州", 
    ["川V"]: "甘孜藏族自治州", 
    ["川W"]: "凉山彝族自治州", 
    ["川X"]: "广安", 
    ["川Y"]: "巴中", 
    ["川Z"]: "眉山", 
    ["渝A"]: "重庆区（江南）", 
    ["渝B"]: "重庆区（江北）", 
    ["渝C"]: "永川区", 
    ["渝F"]: "万州区", 
    ["渝G"]: "涪陵区", 
    ["渝H"]: "黔江区", 
    ["津A"]: "天津", 
    ["津B"]: "天津", 
    ["津C"]: "天津", 
    ["津D"]: "天津", 
    ["津E"]: "天津", 
    ["津F"]: "天津", 
    ["津G"]: "天津", 
    ["津H"]: "天津", 
    ["云A"]: "昆明", 
    ["云V"]: "东川", 
    ["云C"]: "昭通", 
    ["云D"]: "曲靖", 
    ["云E"]: "楚雄彝族自治州", 
    ["云F"]: "玉溪", 
    ["云G"]: "红河哈尼族彝族自治州", 
    ["云H"]: "文山壮族苗族自治州", 
    ["云J"]: "思茅", 
    ["云K"]: "西双版纳傣族自治州", 
    ["云L"]: "大理白族自治州", 
    ["云M"]: "保山", 
    ["云N"]: "德宏傣族景颇族自治州", 
    ["云P"]: "丽江", 
    ["云Q"]: "怒江傈僳族自治州", 
    ["云R"]: "迪庆藏族自治州", 
    ["云S"]: "临沧地区", 
    ["湘A"]: "长沙", 
    ["湘B"]: "株洲", 
    ["湘C"]: "湘潭", 
    ["湘D"]: "衡阳", 
    ["湘E"]: "邵阳", 
    ["湘F"]: "岳阳", 
    ["湘G"]: "张家界", 
    ["湘H"]: "益阳", 
    ["湘J"]: "常德", 
    ["湘K"]: "娄底", 
    ["湘L"]: "郴州", 
    ["湘M"]: "永州", 
    ["湘N"]: "怀化", 
    ["湘U"]: "湘西土家族苗族自治州", 
    ["新A"]: "乌鲁木齐", 
    ["新B"]: "昌吉回族自治州", 
    ["新C"]: "石河子", 
    ["新D"]: "奎屯", 
    ["新E"]: "博尔塔拉蒙古自治州", 
    ["新F"]: "伊犁哈萨克自治州直辖县", 
    ["新G"]: "塔城", 
    ["新H"]: "阿勒泰", 
    ["新J"]: "克拉玛依", 
    ["新K"]: "吐鲁番", 
    ["新L"]: "哈密", 
    ["新M"]: "巴音郭愣蒙古自治州", 
    ["新N"]: "阿克苏", 
    ["新P"]: "克孜勒苏柯尔克孜自治州", 
    ["新Q"]: "喀什", 
    ["新R"]: "和田", 
    ["赣A"]: "南昌", 
    ["赣B"]: "赣州", 
    ["赣C"]: "宜春", 
    ["赣D"]: "吉安", 
    ["赣E"]: "上饶", 
    ["赣F"]: "抚州", 
    ["赣G"]: "九江", 
    ["赣H"]: "景德镇", 
    ["赣J"]: "萍乡", 
    ["赣K"]: "新余", 
    ["赣L"]: "鹰潭", 
    ["赣M"]: "南昌", 
    ["甘A"]: "兰州", 
    ["甘B"]: "嘉峪关", 
    ["甘C"]: "金昌", 
    ["甘D"]: "白银", 
    ["甘E"]: "天水", 
    ["甘F"]: "酒泉", 
    ["甘G"]: "张掖", 
    ["甘H"]: "武威", 
    ["甘J"]: "定西", 
    ["甘K"]: "陇南", 
    ["甘L"]: "平凉", 
    ["甘M"]: "庆阳", 
    ["甘N"]: "临夏回族自治州", 
    ["甘P"]: "甘南藏族自治州", 
    ["陕A"]: "西安", 
    ["陕B"]: "铜川", 
    ["陕C"]: "宝鸡", 
    ["陕D"]: "咸阳", 
    ["陕E"]: "渭南", 
    ["陕F"]: "汉中", 
    ["陕G"]: "安康", 
    ["陕H"]: "商洛", 
    ["陕J"]: "延安", 
    ["陕K"]: "榆林", 
    ["陕V"]: "杨凌高新农业示范区", 
    ["贵A"]: "贵阳", 
    ["贵B"]: "六盘水", 
    ["贵C"]: "遵义", 
    ["贵D"]: "铜仁", 
    ["贵E"]: "黔西南布依族苗族自治州", 
    ["贵F"]: "毕节", 
    ["贵G"]: "安顺", 
    ["贵H"]: "黔东南苗族侗族自治州", 
    ["贵J"]: "黔南布依族苗族自治州", 
    ["青A"]: "西宁", 
    ["青B"]: "海东", 
    ["青C"]: "海北藏族自治州", 
    ["青D"]: "黄南藏族自治州", 
    ["青E"]: "藏族自治州", 
    ["青F"]: "果洛藏族自治州", 
    ["青G"]: "玉树藏族自治州", 
    ["青H"]: "海西蒙古族藏族自治州", 
    ["藏A"]: "拉萨", 
    ["藏B"]: "昌都地区", 
    ["藏C"]: "山南地区", 
    ["藏D"]: "日喀则地区", 
    ["藏E"]: "那曲地区", 
    ["藏F"]: "阿里地区", 
    ["藏G"]: "林芝地区", 
    ["藏H"]: "天全县车辆管理所", 
    ["藏J"]: "格尔木车辆管理所", 
    ["琼A"]: "海口", 
    ["琼B"]: "三亚", 
    ["琼C"]: "琼海", 
    ["琼D"]: "五指山", 
    ["琼E"]: "洋浦", 
    ["沪A"]: "上海", 
    ["沪B"]: "上海", 
    ["沪C"]: "上海", 
    ["沪D"]: "上海", 
    ["沪R"]: "上海"
}

export const lineWay = {
    "YMS-SJS": [{
        "lng": 114.755146,
        "lat": 27.74542
    }, {
        "lng": 114.755685,
        "lat": 27.742223
    }, {
        "lng": 114.755685,
        "lat": 27.742063
    }, {
        "lng": 114.755631,
        "lat": 27.741887
    }, {
        "lng": 114.754625,
        "lat": 27.74056
    }],
    "MAIN-THD": [{
        "lng": 114.801669,
        "lat": 27.730641
    }, {
        "lng": 114.801633,
        "lat": 27.728163
    }, {
        "lng": 114.801597,
        "lat": 27.727827
    }, {
        "lng": 114.801526,
        "lat": 27.727587
    }, {
        "lng": 114.801454,
        "lat": 27.727395
    }, {
        "lng": 114.801292,
        "lat": 27.727139
    }, {
        "lng": 114.80104,
        "lat": 27.726995
    }, {
        "lng": 114.800717,
        "lat": 27.726916
    }, {
        "lng": 114.80034,
        "lat": 27.72682
    }, {
        "lng": 114.799567,
        "lat": 27.726788
    }, {
        "lng": 114.798471,
        "lat": 27.726868
    }],
    "MAIN-MRD": [{
        "lng": 114.801669,
        "lat": 27.730641
    }, {
        "lng": 114.801651,
        "lat": 27.728259
    }, {
        "lng": 114.801615,
        "lat": 27.727875
    }, {
        "lng": 114.801561,
        "lat": 27.727635
    }, {
        "lng": 114.801418,
        "lat": 27.727315
    }, {
        "lng": 114.801274,
        "lat": 27.727091
    }, {
        "lng": 114.801005,
        "lat": 27.726868
    }, {
        "lng": 114.800286,
        "lat": 27.726436
    }, {
        "lng": 114.799927,
        "lat": 27.726276
    }, {
        "lng": 114.79937,
        "lat": 27.726148
    }, {
        "lng": 114.798795,
        "lat": 27.726132
    }, {
        "lng": 114.79804,
        "lat": 27.7261
    }, {
        "lng": 114.79619,
        "lat": 27.7261
    }, {
        "lng": 114.795507,
        "lat": 27.726132
    }, {
        "lng": 114.795327,
        "lat": 27.726196
    }, {
        "lng": 114.793423,
        "lat": 27.727267
    }],
    "MAIN-SJS": [{
        "lng": 114.801669,
        "lat": 27.730641
    }, {
        "lng": 114.801669,
        "lat": 27.728187
    }, {
        "lng": 114.801561,
        "lat": 27.727595
    }, {
        "lng": 114.801418,
        "lat": 27.727259
    }, {
        "lng": 114.801166,
        "lat": 27.726955
    }, {
        "lng": 114.800753,
        "lat": 27.726732
    }, {
        "lng": 114.799998,
        "lat": 27.7263
    }, {
        "lng": 114.799531,
        "lat": 27.726156
    }, {
        "lng": 114.798867,
        "lat": 27.726124
    }, {
        "lng": 114.792803,
        "lat": 27.725884
    }, {
        "lng": 114.79221,
        "lat": 27.725916
    }, {
        "lng": 114.791204,
        "lat": 27.726076
    }, {
        "lng": 114.790198,
        "lat": 27.726396
    }, {
        "lng": 114.789264,
        "lat": 27.726939
    }, {
        "lng": 114.760284,
        "lat": 27.741104
    }, {
        "lng": 114.759799,
        "lat": 27.741296
    }, {
        "lng": 114.759296,
        "lat": 27.741328
    }, {
        "lng": 114.758721,
        "lat": 27.741296
    }, {
        "lng": 114.758003,
        "lat": 27.741168
    }, {
        "lng": 114.754625,
        "lat": 27.74056
    }],
    "MAIN-LFY": [{
        "lng": 114.801669,
        "lat": 27.730641
    }, {
        "lng": 114.80166,
        "lat": 27.728235
    }, {
        "lng": 114.801732,
        "lat": 27.727915
    }, {
        "lng": 114.801876,
        "lat": 27.727467
    }, {
        "lng": 114.80202,
        "lat": 27.727083
    }, {
        "lng": 114.802163,
        "lat": 27.7267
    }, {
        "lng": 114.802343,
        "lat": 27.726412
    }, {
        "lng": 114.80263,
        "lat": 27.726188
    }, {
        "lng": 114.803098,
        "lat": 27.725932
    }, {
        "lng": 114.803601,
        "lat": 27.72574
    }, {
        "lng": 114.809278,
        "lat": 27.723758
    }],
    "MAIN-AQD": [{
        "lng": 114.801669,
        "lat": 27.730641
    }, {
        "lng": 114.801768,
        "lat": 27.720176
    }, {
        "lng": 114.801768,
        "lat": 27.719537
    }, {
        "lng": 114.801804,
        "lat": 27.719057
    }, {
        "lng": 114.801939,
        "lat": 27.718449
    }, {
        "lng": 114.802244,
        "lat": 27.717346
    }, {
        "lng": 114.802711,
        "lat": 27.716275
    }, {
        "lng": 114.803268,
        "lat": 27.715316
    }, {
        "lng": 114.803771,
        "lat": 27.714724
    }, {
        "lng": 114.804472,
        "lat": 27.714308
    }, {
        "lng": 114.805622,
        "lat": 27.714052
    }, {
        "lng": 114.806808,
        "lat": 27.713924
    }, {
        "lng": 114.807814,
        "lat": 27.713956
    }, {
        "lng": 114.808119,
        "lat": 27.713956
    }, {
        "lng": 114.80873,
        "lat": 27.714036
    }, {
        "lng": 114.809682,
        "lat": 27.71418
    }],
    "MAIN-LWD": [{
        "lng": 114.801669,
        "lat": 27.730641
    }, {
        "lng": 114.801768,
        "lat": 27.720448
    }, {
        "lng": 114.801804,
        "lat": 27.719169
    }, {
        "lng": 114.802163,
        "lat": 27.717634
    }, {
        "lng": 114.802702,
        "lat": 27.716291
    }, {
        "lng": 114.803457,
        "lat": 27.71498
    }, {
        "lng": 114.804247,
        "lat": 27.714436
    }, {
        "lng": 114.807859,
        "lat": 27.71143
    }, {
        "lng": 114.808487,
        "lat": 27.710854
    }, {
        "lng": 114.80917,
        "lat": 27.710087
    }, {
        "lng": 114.809673,
        "lat": 27.709479
    }, {
        "lng": 114.809961,
        "lat": 27.709031
    }, {
        "lng": 114.810032,
        "lat": 27.708839
    }, {
        "lng": 114.810032,
        "lat": 27.708392
    }, {
        "lng": 114.809961,
        "lat": 27.708008
    }, {
        "lng": 114.809601,
        "lat": 27.707049
    }, {
        "lng": 114.805074,
        "lat": 27.698925
    }]
}